acoolbest/charge_STM32F103ZET6/User/dwgl_spi.c
}

//*****************************************************************************
// #define SPI2_MOSI_PIN			GPIO_Pin_15
// #define SPI2_MOSI_PORT			GPIOB
// #define SPI2_MISO_PIN			GPIO_Pin_14
// #define SPI2_MISO_PORT			GPIOB
// #define SPI2_CLK_PIN			  GPIO_Pin_13
// #define SPI2_CLK_PORT			GPIOB

void GPIOSPI_Send_BYTE(u8 data)
{
	u16 tx_data,t_data,T_NY;

	tx_data = data;
	tx_data = (tx_data<<8);

	T_NY = (tx_data&0X8000);   //bit7

	t_data = (GPIOB->ODR&0X7FFF);
	t_data |= T_NY;
	GPIOB->ODR = t_data;
	GPIOB->BSRR = SPI2_CLK_PIN;	

	tx_data <<= 1;	
	T_NY = (tx_data&0X8000);   //bit6
	GPIOB->BRR = SPI2_CLK_PIN;	

	t_data = (GPIOB->ODR&0X7FFF);
	t_data |= T_NY;
	GPIOB->ODR = t_data;
	GPIOB->BSRR = SPI2_CLK_PIN;	

	tx_data <<= 1;	
	T_NY = (tx_data&0X8000);   //bit5
	GPIOB->BRR = SPI2_CLK_PIN;	

	t_data = (GPIOB->ODR&0X7FFF);
	t_data |= T_NY;
	GPIOB->ODR = t_data;
	GPIOB->BSRR = SPI2_CLK_PIN;	

	tx_data <<= 1;	
	T_NY = (tx_data&0X8000);   //bit4
	GPIOB->BRR = SPI2_CLK_PIN;	

	t_data = (GPIOB->ODR&0X7FFF);
	t_data |= T_NY;
	GPIOB->ODR = t_data;
	GPIOB->BSRR = SPI2_CLK_PIN;	

	tx_data <<= 1;	
	T_NY = (tx_data&0X8000);   //bit3
	GPIOB->BRR = SPI2_CLK_PIN;	

	t_data = (GPIOB->ODR&0X7FFF);
	t_data |= T_NY;
	GPIOB->ODR = t_data;
	GPIOB->BSRR = SPI2_CLK_PIN;	

	tx_data <<= 1;	
	T_NY = (tx_data&0X8000);   //bit2
	GPIOB->BRR = SPI2_CLK_PIN;	

	t_data = (GPIOB->ODR&0X7FFF);
	t_data |= T_NY;
	GPIOB->ODR = t_data;
	GPIOB->BSRR = SPI2_CLK_PIN;	

	tx_data <<= 1;	
	T_NY = (tx_data&0X8000);   //bit1
	GPIOB->BRR = SPI2_CLK_PIN;	

	t_data = (GPIOB->ODR&0X7FFF);
	t_data |= T_NY;
	GPIOB->ODR = t_data;
	GPIOB->BSRR = SPI2_CLK_PIN;	

	tx_data <<= 1;	
	T_NY = (tx_data&0X8000);   //bit0
	GPIOB->BRR = SPI2_CLK_PIN;	

	t_data = (GPIOB->ODR&0X7FFF);
	t_data |= T_NY;
	GPIOB->ODR = t_data;
	GPIOB->BSRR = SPI2_CLK_PIN;	

	tx_data <<= 1;	
	T_NY = (tx_data&0X8000);   //bit
	GPIOB->BRR = SPI2_CLK_PIN;	

	//GPIO_ResetBits(SPI2_MOSI_PORT, SPI2_MOSI_PIN);
	//GPIO_SetBits(SPI2_MISO_PORT, SPI2_MISO_PIN);
	//GPIO_ResetBits(SPI2_MISO_PORT, SPI2_MISO_PIN);
}
void GPIOSPI_Send1_BYTE(u8 data)
{
	u8 tx_data,T_NY;
	
	tx_data = data;

	T_NY = (tx_data&0X80);   //bit7
	if(T_NY>0)
	{
		GPIOB->BSRR = SPI2_MOSI_PIN;	
	}
	else
	{
		GPIOB->BRR = SPI2_MOSI_PIN;	
	}
	GPIOB->BSRR = SPI2_CLK_PIN;	
	tx_data <<= 1;

	T_NY = (tx_data&0X80);   //bit6
	GPIOB->BRR = SPI2_CLK_PIN;	

	if(T_NY>0)
	{
		GPIOB->BSRR = SPI2_MOSI_PIN;	
	}
	else
	{
		GPIOB->BRR = SPI2_MOSI_PIN;	
	}
	GPIOB->BSRR = SPI2_CLK_PIN;	
	tx_data <<= 1;

	T_NY = (tx_data&0X80);   //bit5
	GPIOB->BRR = SPI2_CLK_PIN;	

	if(T_NY>0)
	{
		GPIOB->BSRR = SPI2_MOSI_PIN;	
	}
	else
	{
		GPIOB->BRR = SPI2_MOSI_PIN;	
	}
	GPIOB->BSRR = SPI2_CLK_PIN;	
	tx_data <<= 1;

	T_NY = (tx_data&0X80);   //bit4
	GPIOB->BRR = SPI2_CLK_PIN;	

	if(T_NY>0)
	{
		GPIOB->BSRR = SPI2_MOSI_PIN;	
	}
	else
	{
		GPIOB->BRR = SPI2_MOSI_PIN;	
	}
	GPIOB->BSRR = SPI2_CLK_PIN;	
	tx_data <<= 1;

	T_NY = (tx_data&0X80);   //bit3
	GPIOB->BRR = SPI2_CLK_PIN;	

	if(T_NY>0)
	{
		GPIOB->BSRR = SPI2_MOSI_PIN;	
	}
	else
	{
		GPIOB->BRR = SPI2_MOSI_PIN;	
	}
	GPIOB->BSRR = SPI2_CLK_PIN;	
	tx_data <<= 1;

	T_NY = (tx_data&0X80);   //bit2
	GPIOB->BRR = SPI2_CLK_PIN;	

	if(T_NY>0)
	{
		GPIOB->BSRR = SPI2_MOSI_PIN;	
	}
	else
	{
		GPIOB->BRR = SPI2_MOSI_PIN;	
	}
	GPIOB->BSRR = SPI2_CLK_PIN;	
	tx_data <<= 1;

	T_NY = (tx_data&0X80);   //bit1
	GPIOB->BRR = SPI2_CLK_PIN;	

	if(T_NY>0)
	{
		GPIOB->BSRR = SPI2_MOSI_PIN;	
	}
	else
	{
		GPIOB->BRR = SPI2_MOSI_PIN;	
	}
	GPIOB->BSRR = SPI2_CLK_PIN;	
	tx_data <<= 1;

	T_NY = (tx_data&0X80);   //bit0
	GPIOB->BRR = SPI2_CLK_PIN;	

	if(T_NY>0)
	{
		GPIOB->BSRR = SPI2_MOSI_PIN;	
	}
	else
	{
		GPIOB->BRR = SPI2_MOSI_PIN;	
	}
	GPIOB->BSRR = SPI2_CLK_PIN;	
	tx_data <<= 1;

	T_NY = (tx_data&0X80);   //bitx
	GPIOB->BRR = SPI2_CLK_PIN;
}

//*****************************************************************************
u8 GPIOSPI_SR_BYTE(u8 data)
{
	u8 rx_data,tx_data,T_NY;
	u16 R_NY;
	tx_data = data;
	rx_data =0;

	T_NY = (tx_data&0X80);   //bit7
	if(T_NY>0)
	{
		GPIOA->BSRR = SPI2_MOSI_PIN;	
	}
	else
	{
		GPIOA->BRR = SPI2_MOSI_PIN;	
	}
	tx_data <<= 1;
	rx_data <<= 1;
	GPIOA->BSRR = SPI2_CLK_PIN;	
	R_NY = GPIOA->IDR & SPI2_MISO_PIN;
	if(R_NY>0)
	{
		rx_data++;
	}
	else
	{
		R_NY = rx_data;
	}	
	GPIOA->BRR = SPI2_CLK_PIN;	

	T_NY = (tx_data&0X80);   //bit6
	if(T_NY>0)
	{
		GPIOA->BSRR = SPI2_MOSI_PIN;	
	}
	else
	{
		GPIOA->BRR = SPI2_MOSI_PIN;	
	}
	tx_data <<= 1;
	rx_data <<= 1;
	GPIOA->BSRR = SPI2_CLK_PIN;	
	R_NY = GPIOA->IDR & SPI2_MISO_PIN;
	if(R_NY>0)
	{
		rx_data++;
	}
	else
	{
		R_NY = rx_data;
	}	
	GPIOA->BRR = SPI2_CLK_PIN;	

	T_NY = (tx_data&0X80);   //bit5
	if(T_NY>0)
	{
		GPIOA->BSRR = SPI2_MOSI_PIN;	
	}
	else
	{
		GPIOA->BRR = SPI2_MOSI_PIN;	
	}
	tx_data <<= 1;
	rx_data <<= 1;
	GPIOA->BSRR = SPI2_CLK_PIN;	
	R_NY = GPIOA->IDR & SPI2_MISO_PIN;
	if(R_NY>0)
	{
		rx_data++;
	}
	else
	{
		R_NY = rx_data;
	}	
	GPIOA->BRR = SPI2_CLK_PIN;	

	T_NY = (tx_data&0X80);   //bit4
	if(T_NY>0)
	{
		GPIOA->BSRR = SPI2_MOSI_PIN;	
	}
	else
	{
		GPIOA->BRR = SPI2_MOSI_PIN;	
	}
	tx_data <<= 1;
	rx_data <<= 1;
	GPIOA->BSRR = SPI2_CLK_PIN;	
	R_NY = GPIOA->IDR & SPI2_MISO_PIN;
	if(R_NY>0)
	{
		rx_data++;
	}
	else
	{
		R_NY = rx_data;
	}	
	GPIOA->BRR = SPI2_CLK_PIN;	

	T_NY = (tx_data&0X80);   //bit3
	if(T_NY>0)
	{
		GPIOA->BSRR = SPI2_MOSI_PIN;	
	}
	else
	{
		GPIOA->BRR = SPI2_MOSI_PIN;	
	}
	tx_data <<= 1;
	rx_data <<= 1;
	GPIOA->BSRR = SPI2_CLK_PIN;	
	R_NY = GPIOA->IDR & SPI2_MISO_PIN;
	if(R_NY>0)
	{
		rx_data++;
	}
	else
	{
		R_NY = rx_data;
	}	
	GPIOA->BRR = SPI2_CLK_PIN;	

	T_NY = (tx_data&0X80);   //bit2
	if(T_NY>0)
	{
		GPIOA->BSRR = SPI2_MOSI_PIN;	
	}
	else
	{
		GPIOA->BRR = SPI2_MOSI_PIN;	
	}
	tx_data <<= 1;
	rx_data <<= 1;
	GPIOA->BSRR = SPI2_CLK_PIN;	
	R_NY = GPIOA->IDR & SPI2_MISO_PIN;
	if(R_NY>0)
	{
		rx_data++;
	}
	else
	{
		R_NY = rx_data;
	}	
	GPIOA->BRR = SPI2_CLK_PIN;	

	T_NY = (tx_data&0X80);   //bit1
	if(T_NY>0)
	{
		GPIOA->BSRR = SPI2_MOSI_PIN;	
	}
	else
	{
		GPIOA->BRR = SPI2_MOSI_PIN;	
	}
	tx_data <<= 1;
	rx_data <<= 1;
	GPIOA->BSRR = SPI2_CLK_PIN;	
	R_NY = GPIOA->IDR & SPI2_MISO_PIN;
	if(R_NY>0)
	{
		rx_data++;
	}
	else
	{
		R_NY = rx_data;
	}	
	GPIOA->BRR = SPI2_CLK_PIN;	

	T_NY = (tx_data&0X80);   //bit0
	if(T_NY>0)
	{
		GPIOA->BSRR = SPI2_MOSI_PIN;	
	}
	else
	{
		GPIOA->BRR = SPI2_MOSI_PIN;	
	}
	tx_data <<= 1;
	rx_data <<= 1;
	GPIOA->BSRR = SPI2_CLK_PIN;	
	R_NY = GPIOA->IDR & SPI2_MISO_PIN;
	if(R_NY>0)
	{
		rx_data++;
	}
	else
	{
		R_NY = rx_data;
	}	
	GPIOA->BRR = SPI2_CLK_PIN;	

	//NY = GPIO_ReadInputDataBit(SPI2_MISO_PORT,SPI2_MISO_PIN);	
	//GPIO_ResetBits(SPI2_MOSI_PORT, SPI2_MOSI_PIN);
	//GPIO_SetBits(SPI2_MISO_PORT, SPI2_MISO_PIN);
	//GPIO_ResetBits(SPI2_MISO_PORT, SPI2_MISO_PIN);

