acoolbest/charge_STM32F103ZET6/User/dwgl_spi.c
	return rx_data;

}
//*****************************************************************************
void GPIOSPI_Send_Data(u8 * p,u16 len)
{
	u16 i;
	for(i=0;i<len;i++)
	{
		GPIOSPI_Send_BYTE(*p);
		p++;
	}
}

//*****************************************************************************
void GPIOSPI_Send1_Data(u8 * p,u16 len)
{
	u16 i;
	for(i=0;i<len;i++)
	{
		GPIOSPI_Send1_BYTE(*p);
		p++;
	}
}
//*****************************************************************************
void GPIOSPI_SR_Data(u8 * tx,u8 * rx,u16 len)
{
	u16 i;
	for(i=0;i<len;i++)
	{
		*rx= GPIOSPI_SR_BYTE(*tx);
		tx++;
		rx++;
	}
}

void FLASH2_GPIOSPI_Read (unsigned int write_addr, unsigned char *buffer, unsigned int len)//FLASH-读出LEN个字节-
{ 
	//u8  i;
	unsigned char addr1,addr2,addr3;
	addr1 = ((write_addr&0xff0000)>>16);
	addr2 = ((write_addr&0xff00)>>8);
	addr3 = ((write_addr&0xff));
	//RAM_CS   = 1;FLASH_CS   = 0;  //片选使能
	//delay_cycle(2);  
	FLASH2_CSSelect(Enable);                  

	while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET);
	SPI1->DR = FLASH_CMD_READ;       //读取数据

	//FLASH_u8temp=SPI1->DR;
	while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET);
	SPI1->DR = addr1;
	while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET);
	SPI1->DR = addr2;
	while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET);
	SPI1->DR = addr3;

	{
		delay_cycle(500);  
		while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_RXNE) == RESET);
		FLASH_u8temp=SPI1->DR;			
		SPI1_DMARecive( buffer, len );			
		while(len>0)
		{
			//buffer[i]= FLASH2_ReadByte();
			while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET);
			SPI1->DR = 0;      //读状态寄存器
			len--;
		}
		delay_cycle(500);
		/* Enable SPI1 DMA RX request */
		SPI1->CR2 &= ~((u32)1<<0);                    //关闭接收缓冲区DMA使能
		delay_cycle(500);
	}
	delay_cycle(2);
	FLASH2_CSSelect(Disable); 

}

//------FLASH-写入LEN个字节---------
void FLASH2_GPIOSPI_Write(unsigned int write_addr, unsigned char *desbuffer,unsigned int len) // reentrant//FLASH-写入LEN个字节
{ 
	unsigned char addr1,addr2,addr3;
	addr1 = ((write_addr&0xff0000)>>16);
	addr2 = ((write_addr&0xff00)>>8);
	addr3 = ((write_addr&0xff));

	//RAM_CS   = 1;FLASH_CS   = 0; 
	FLASH2_CSSelect( Enable);                  	                   
	/* Loop while DR register in not emplty */
	while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET);
	/* Send byte through the SPI2 peripheral */
	//SPI_I2S_SendData(SPI1, data);
	SPI1->DR = FLASH_CMD_WREN  ;     //  写使能 
	delay_cycle(500);   
	FLASH2_CSSelect(Disable);  

	//	RAM_CS   = 1;FLASH_CS   = 0; 
	FLASH2_CSSelect( Enable);                  
	while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET);
	SPI1->DR  = FLASH_CMD_PP; //写页

	while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET);
	SPI1->DR  = addr1; 	 //写地址

	while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET);
	SPI1->DR  = addr2;

	while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET);
	SPI1->DR  = addr3;

	while(len>0)
	{
		while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET);
		SPI1->DR  = *desbuffer; 	 //写数据
		desbuffer++;
		len--;
	}

	delay_cycle (500);                        
	FLASH2_CSSelect(Disable); 

	//FLASH2_CSSelectEnable( cs_select);
	//Delay_ms (1);

	//SPI0DAT  = FLASH_CMD_WRDI;        //写无效
	//while (!SPIF);                       
	//SPIF     = 0;                        

	//RAM_CS   = 1;FLASH_CS   = 1;   
	//FLASH2_CSSelectDisable(cs_select);
	//Delay_ms (1);  

	//FLASH2_IsBusy(1); 
	FLASH2_GPIOSPI_IsBusy();
}
//------------------------------------------------------------
void FLASH2_GPIOSPI_IsBusy(void)// 
{
	do
	{ 
		FLASH2_CSSelect(Enable);   
		delay_cycle(10);  
		FLASH_u8temp = SPI1->DR;

		//SPI0DAT  = FLASH_CMD_RDSTATUSR;   
		while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET);
		SPI1->DR  =	FLASH_CMD_RDSR  ;  
		while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_RXNE) == RESET);
		FLASH_u8temp = SPI1->DR;

		while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET);
		SPI1->DR  =	FLASH_CMD_RDSR  ;       
		while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_RXNE) == RESET);
		FLASH_u8temp = SPI1->DR;

		FLASH2_CSSelect(Disable); 
	}
	//while(((SPI1->DR) & 0x01) == 0x01); //Write In Progress Bit:"0" indicates the device is ready (default);"1" indicates a write cycle is in progress and the device is busy.
	while(((FLASH_u8temp) & 0x01) == 0x01); //Write In Progress Bit:"0" indicates the device is ready (default);"1" indicates a write cycle is in progress and the device is busy.
}

void FLASH2_GPIOSPI_SER(unsigned int u32_addr)  ////每次擦擦4K
{
	unsigned char addr1,addr2,addr3;
	addr1 = ((u32_addr&0xff0000)>>16);
	addr2 = ((u32_addr&0xff00)>>8);
	addr3 = ((u32_addr&0xff));
	FLASH2_CSSelect( Enable);                  

	while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET);
	SPI1->DR = FLASH_CMD_WREN  ;     //  写使能 
	delay_cycle(1000);   
	FLASH2_CSSelect(Disable);                                     

	//---------FLASH_CMD_SE--------------
	//  RAM_CS   = 1;FLASH_CS   = 0;  
	FLASH2_CSSelect(Enable);   

	while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET);
	SPI1->DR = FLASH_CMD_SER;//         0xD7        //扇区擦除
	while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET);
	SPI1->DR = addr1;
	while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET);
	SPI1->DR = addr2;
	while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET);
	SPI1->DR = addr3;
	/* Wait to receive a byte */
	while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_RXNE) == RESET);
	delay_cycle(1000);   

	//	RAM_CS   = 1;FLASH_CS   = 1; 
	FLASH2_CSSelect(Disable); 

	///-------指导擦除结束------------------	 
	//	 RAM_CS   = 1;FLASH_CS   = 0;   
	//	FLASH2_IsBusy(1); 
	FLASH2_GPIOSPI_IsBusy();	 
	delay_cycle(2);  
}

void FLASH2_GPIOSPI_SE(unsigned int u32_addr)  ////每次擦擦64K
{	
	unsigned char addr1,addr2,addr3;
	addr1 = ((u32_addr&0xff0000)>>16);
	addr2 = ((u32_addr&0xff00)>>8);
	addr3 = ((u32_addr&0xff));
	FLASH2_CSSelect( Enable);                  

	while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET);
	SPI1->DR = FLASH_CMD_WREN  ;     //  写使能 

	//RAM_CS   = 1;FLASH_CS   = 1;   
	delay_cycle(1000);   
	FLASH2_CSSelect(Disable);                                     

	//---------FLASH_CMD_SE--------------
	//RAM_CS   = 1;FLASH_CS   = 0;  
	FLASH2_CSSelect(Enable);   

	while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET);
	SPI1->DR = FLASH_CMD_SE;//         0xD7        //扇区擦除
	while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET);
	SPI1->DR = addr1;
	while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET);
	SPI1->DR = addr2;
	while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET);
	SPI1->DR = addr3;
	/* Wait to receive a byte */
	while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_RXNE) == RESET);
	delay_cycle(1000);

	//RAM_CS   = 1;FLASH_CS   = 1; 
	FLASH2_CSSelect(Disable); 

	///-------指导擦除结束------------------	 
	//RAM_CS   = 1;FLASH_CS   = 0;   
	//FLASH2_IsBusy(1); 
	FLASH2_GPIOSPI_IsBusy();	 
	delay_cycle(2);  
}

// void FLASH2_GPIOSPI_Read (unsigned int write_addr, unsigned char *buffer, unsigned int len)//FLASH-读出LEN个字节-
// { 
//    //u8  i;
//    unsigned char addr1,addr2,addr3;
// 		addr1 = ((write_addr&0xff0000)>>16);
// 		addr2 = ((write_addr&0xff00)>>8);
// 		addr3 = ((write_addr&0xff));
//   //   RAM_CS   = 1;FLASH_CS   = 0;  //片选使能
// // delay_cycle(2);  
//    FLASH2_CSSelect( Enable);    //RAM片选工作              
//    
// // 		while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET);
// //	  SPI1->DR = FLASH_CMD_READ;       //读取数据
// 		FLASH_u8temp = GPIOSPI_SR_BYTE(FLASH_CMD_READ);
// 	
// // 		while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET);
// //	  SPI1->DR = addr1;
// 		FLASH_u8temp = GPIOSPI_SR_BYTE(addr1);
// // 		while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET);
// //	  SPI1->DR = addr2;
// 		FLASH_u8temp = GPIOSPI_SR_BYTE(addr2);
// // 		while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET);
// //	  SPI1->DR = addr3;
// 		FLASH_u8temp = GPIOSPI_SR_BYTE(addr3);

// //		if(fast_read ==1)
// 		{
// 		while(len>0)
// 			{
// 		*buffer=GPIOSPI_SR_BYTE(0x55);
// 	  buffer++;
// 		len--;
// 			}

