acoolbest/charge_STM32F103ZET6/User/dwgl_spi.c
// 		}
//     delay_cycle(2);
// 	FLASH2_CSSelect(Disable); 
// 		
// 	}
// 	
// //------FLASH-写入LEN个字节---------
// void FLASH2_GPIOSPI_Write(unsigned int write_addr, unsigned char *desbuffer,unsigned int len) // reentrant//FLASH-写入LEN个字节
// { 
//    unsigned char addr1,addr2,addr3;
// 		addr1 = ((write_addr&0xff0000)>>16);
// 		addr2 = ((write_addr&0xff00)>>8);
// 		addr3 = ((write_addr&0xff));

//    FLASH2_CSSelect( Enable);                  	                   
// //  while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET);
// //	  SPI1->DR = FLASH_CMD_WREN  ;     //  写使能 
// 		FLASH_u8temp = GPIOSPI_SR_BYTE(FLASH_CMD_WREN);
// 	
// 	delay_cycle(2);  
// 	FLASH2_CSSelect(Disable);  
// 	
//    FLASH2_CSSelect( Enable);                  
// //  while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET);
// //   SPI1->DR  = FLASH_CMD_PP; //写页
// 		FLASH_u8temp = GPIOSPI_SR_BYTE(FLASH_CMD_PP);

// // 		while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET);
// //	  SPI1->DR = addr1;
// 		FLASH_u8temp = GPIOSPI_SR_BYTE(addr1);
// // 		while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET);
// //	  SPI1->DR = addr2;
// 		FLASH_u8temp = GPIOSPI_SR_BYTE(addr2);
// // 		while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET);
// //	  SPI1->DR = addr3;
// 		FLASH_u8temp = GPIOSPI_SR_BYTE(addr3);
// 	
//    while(len>0)
//     {
// 		FLASH_u8temp = GPIOSPI_SR_BYTE(*desbuffer); //写数据
// 	  desbuffer++;
// 	  len--;
//      }
// 		 
//      delay_cycle (2);                        
//  FLASH2_CSSelect(Disable); 
// 		 
// //	FLASH2_IsBusy(1); 
// 	FLASH2_GPIOSPI_IsBusy();	 
// }
// //------------------------------------------------------------
// void FLASH2_GPIOSPI_IsBusy(void)// 
// {
// //   unsigned char i;

//   do
//    { 
// 	 FLASH2_CSSelect(Enable);   
// 		delay_cycle(10);  
// 		 
// 		FLASH_u8temp = GPIOSPI_SR_BYTE(FLASH_CMD_RDSR);
// 		FLASH_u8temp = GPIOSPI_SR_BYTE(0x55);
// 		 
// 		delay_cycle(10);  
// 	FLASH2_CSSelect(Disable); 
//      } 
// 		 while(((FLASH_u8temp) & 0x01) == 0x01); //Write In Progress Bit:"0" indicates the device is ready (default);"1" indicates a write cycle is in progress and the device is busy.

// }

// void FLASH2_GPIOSPI_SER(unsigned int u32_addr)  ////每次擦擦4K
// {
//    unsigned char addr1,addr2,addr3;
// 		addr1 = ((u32_addr&0xff0000)>>16);
// 		addr2 = ((u32_addr&0xff00)>>8);
// 		addr3 = ((u32_addr&0xff));
// 	                  
// 		FLASH2_CSSelect( Enable);                  	                   
// 		FLASH_u8temp = GPIOSPI_SR_BYTE(FLASH_CMD_WREN);
// 		delay_cycle(2);  
// 		FLASH2_CSSelect(Disable);  
//     
// 		FLASH2_CSSelect(Enable);  
// 	
// 		FLASH_u8temp = GPIOSPI_SR_BYTE(FLASH_CMD_SER);//         0xD7  //扇区擦除

// 		FLASH_u8temp = GPIOSPI_SR_BYTE(addr1);
// 		FLASH_u8temp = GPIOSPI_SR_BYTE(addr2);
// 		FLASH_u8temp = GPIOSPI_SR_BYTE(addr3);

// 		FLASH2_CSSelect(Disable); 
//  
// 	FLASH2_GPIOSPI_IsBusy();	 
// }
// void FLASH2_GPIOSPI_SE(unsigned int u32_addr)  ////每次擦擦64K
// {
//    unsigned char addr1,addr2,addr3;
// 		addr1 = ((u32_addr&0xff0000)>>16);
// 		addr2 = ((u32_addr&0xff00)>>8);
// 		addr3 = ((u32_addr&0xff));
// 	                  
// 		FLASH2_CSSelect( Enable);                  	                   
// 		FLASH_u8temp = GPIOSPI_SR_BYTE(FLASH_CMD_WREN);
// 		delay_cycle(2);  
// 		FLASH2_CSSelect(Disable);  
//     
// 		FLASH2_CSSelect(Enable);  
// 	
// 		FLASH_u8temp = GPIOSPI_SR_BYTE(FLASH_CMD_SE);//         0xD7  //扇区擦除

// 		FLASH_u8temp = GPIOSPI_SR_BYTE(addr1);
// 		FLASH_u8temp = GPIOSPI_SR_BYTE(addr2);
// 		FLASH_u8temp = GPIOSPI_SR_BYTE(addr3);

// 		FLASH2_CSSelect(Disable); 
//  
// 	FLASH2_GPIOSPI_IsBusy();	 
// }

//*****************************************************************************
void SPI_Configuration(void)
{
	SPI1_Receive_Pointer = SPI_BUFFER;
	SPI1_Trans_Pointer = SPI_BUFFER;
	SPI1_Init();
	//SPI2_Init();
	SPI1_Receive_BufSize = 128;
	//SPI2_Receive_BufSize = 0;
}
/********************************END OF FILE***********************************/

